tap "carlocab/personal"
tap "clojure-lsp/brew"
tap "coursier/formulas"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "oven-sh/bun"
tap "txn2/tap"
tap "virtuslab/scala-cli"
# New file format for still image compression
brew "jpeg-xl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# User-friendly launcher for Bazel
brew "bazelisk"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Generate compilation database for clang tooling
brew "bear"
# Collection of portable C++ source libraries
brew "boost"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# Compiler for the Scheme programming language
brew "chicken", link: false
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Open source suite of directory software
brew "openldap"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Postgres C API library
brew "libpq"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Distributed, open source, package manager for C/C++
brew "conan"
# Debugger for the Go programming language
brew "delve"
# Load/unload environment variables based on $PWD
brew "direnv"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# XML 1.0 parser
brew "expat"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU compiler collection
brew "gcc@11"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golang-migrate"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Dynamic language and bytecode vm
brew "janet"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes command-line interface
brew "kubernetes-cli"
# High-performance theorem prover
brew "z3"
# Next-gen compiler infrastructure
brew "llvm"
# Portable D programming language compiler
brew "ldc"
# Build tool for Clojure
brew "leiningen"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# C library for files containing sampled sound
brew "libsndfile"
# Next-gen compiler infrastructure
brew "llvm@12"
# Java-based project management
brew "maven"
# Hash utilities
brew "md5sha1sum", link: false
# Scalable distributed version control system
brew "mercurial"
# Scala language server
brew "metals"
# Scala build tool
brew "mill"
# Mock code autogenerator for Golang
brew "mockery"
# Open source relational database management system
brew "mysql"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple NodeJS versions
brew "nodenv"
# OCaml package manager
brew "opam"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Object-relational database system
brew "postgresql@15"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Rust toolchain installer
brew "rustup-init"
# Build tool for Scala projects
brew "sbt"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# C++ Library Manager
brew "vcpkg"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Extract, view, and test RAR archives
brew "carlocab/personal/unrar"
# Language Server (LSP) for Clojure
brew "clojure-lsp/brew/clojure-lsp-native"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Kubernetes bulk port forwarding utility.
brew "txn2/tap/kubefwd"
# Launcher for ScalaCli
brew "virtuslab/scala-cli/scala-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# E-books management software
cask "calibre"
# DjVu viewer and browser plugin
cask "djview"
# App to build and share containerised applications and microservices
cask "docker"
# Text editor
cask "emacs"
# Collaborative team software
cask "figma"
cask "font-hack"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
cask "graalvm-ce-java17"
cask "graalvm-ce-java19"
# Desktop automation application
cask "hammerspoon"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Music streaming service
cask "spotify"
# To-do list
cask "todoist"
# Native desktop client for WhatsApp
cask "whatsapp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
